---
kind: method
id: M:Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs.GetViewIds
source: html/df6605f2-a998-0f9d-bc71-3171c1c966ae.htm
---
# Autodesk.Revit.DB.Events.ViewsExportedByContextEventArgs.GetViewIds Method

Gets the views that were exported by CustomExporter.

## Syntax (C#)
```csharp
public IList<ElementId> GetViewIds()
```

## Returns
The views that were exported by CustomExporter.